Revit 2027 API
Parameter.IsReadOnly Property
Get the readonly property of the parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override bool IsReadOnly { get; }
Public Overrides ReadOnly Property IsReadOnly As Boolean
	Get
public:
virtual property bool IsReadOnly {
	bool get () override;
}
abstract IsReadOnly : bool with get
override IsReadOnly : bool with get
Property Value
Boolean
Remarks
This function can be used to check if the parameter is read-only.
See Also
Reference
Parameter Class
Autodesk.Revit.DB Namespace